snlkuharlocal/src/Documents/Взаимозачет/Взаимозачет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Взаимозачет</name>
  <comment>Взаимозачет</comment>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.Претензия</basedOn>
  <basedOn>Document.ЗаявкаНаОплату</basedOn>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоДокументамРасчетов</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент_Дебитор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор_Дебитор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент_Кредитор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор_Кредитор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>EnumRef.ВидыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Докоснование</name>
    <type>
      <types>DocumentRef.ЗаявкаНаОплату</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.Претензия</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Взаимозачеты</name>
    <attributes>
      <name>Контрагент_Дебитор</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор_Дебитор</name>
      <type>
        <types>CatalogRef.Договоры</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент_Кредитор</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор_Кредитор</name>
      <type>
        <types>CatalogRef.Договоры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>СуммаВал</name>
    <comment>Сумма в рублях</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <comment>Сумма в валюте расчетов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата_НачалаЗадолженности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Документ_ЗакрытогоПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УИД_СтрокиПлатежа</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Enums/КодыОперацийОстатки/КодыОперацийОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КодыОперацийОстатки</name>
  <enumValues>
    <name>ВводОстатков</name>
  </enumValues>
  <enumValues>
    <name>Закупка</name>
    <comment>Закупка</comment>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
    <comment>Продажа</comment>
  </enumValues>
  <enumValues>
    <name>Рекламация</name>
    <comment>Рекламация</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПокупателя</name>
    <comment>Возврат от покупателя</comment>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
    <comment>Перемещение</comment>
  </enumValues>
  <enumValues>
    <name>Пересортица</name>
    <comment>Пересортица</comment>
  </enumValues>
  <enumValues>
    <name>Списание</name>
    <comment>Списание</comment>
  </enumValues>
  <enumValues>
    <name>Оприходование</name>
    <comment>Оприходование</comment>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>Прочее</comment>
  </enumValues>
  <enumValues>
    <name>ЗакупкаР</name>
    <comment>Закупка (реальная)</comment>
  </enumValues>
  <enumValues>
    <name>Инвентаризация</name>
    <comment>Инвентаризация</comment>
  </enumValues>
  <enumValues>
    <name>Бонус</name>
  </enumValues>
  <enumValues>
    <name>Взаимозачет</name>
  </enumValues>
  <enumValues>
    <name>Комплектация</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеСертификата</name>
  </enumValues>
  <enumValues>
    <name>Переоценка</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПоставщику</name>
    <comment>Возврат поставщику</comment>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
  </enumValues>
  <enumValues>
    <name>АгентскийДоговор</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/Договоры/Договоры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Договоры</name>
  <owners>Catalog.Контрагенты</owners>
  <owners>Catalog.ФизическиеЛица</owners>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛимитКредита</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаКредита</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаКредита</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияОплаты</name>
    <type>
      <types>EnumRef.УсловияОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтсрочкаПлатежа</name>
    <type>
      <types>CatalogRef.ОтсрочкиПлатежа</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСкидок</name>
    <type>
      <types>CatalogRef.ТипыСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>КодЦБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодБух</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>19</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>Ставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойДоговор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаПроцентовПоКредиту</name>
    <type>
      <types>EnumRef.СпособыРасчетаПроцентовПоКредиту</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентПоКредиту</name>
    <comment>Процент по кредиту (Периодический реквизит)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора_Новый</name>
    <type>
      <types>CatalogRef.ВидыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопСоглашение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньДоступа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КассовыйДоговорТЦ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоставщика</name>
    <type>
      <types>CatalogRef.КодыПоставщиков</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентСкидкиСБ</name>
    <comment>Процент скидки для сезонного бонусуа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантИспользованияДоговоров</name>
    <comment>0 - указыввается вручную, 1 - расчеты по счетам, 2 - используется основной договор</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйСчетДляОплаты</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>EnumRef.ВидыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользоватьМатрицу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеСкановДоговоров</name>
    <type>
      <types>EnumRef.СостоянияСкановДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийСБ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерАрхивнойКоробки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РезультатПроверкиСБ</name>
    <type>
      <types>CatalogRef.РезультатыПроверкиСБ</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласованоБухгалтерией</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаАСФ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВходящийКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛогистическоеПлечо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеФайлы</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>CatalogRef.ДополнительныеФайлыДоговора</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Documents/Взаимозачет/ObjectModule.bsl
Перем  Рубли,Доллары;
//Катаев+ 06/10/14
Перем НужноВыгружать;
//Катаев- 06/10/14

Функция ПересчетМЮ(Сумма,Валюта1,Курс1,Валюта2,Курс2)	
	Если Валюта1=Рубли И Валюта2=Доллары Тогда		
		Возврат ?(Курс1=0,0,Сумма/Курс1);	
	ИначеЕсли Валюта1=Доллары И Валюта2=Рубли Тогда
		Возврат Сумма*Курс1;		
	Иначе
		Возврат глПересчет(Сумма,Валюта1,Курс1,Валюта2,Курс2);	
	КонецЕсли; 	
КонецФункции // ПересчетМЮ()

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	Доллары				=Справочники.Валюты.НайтиПоКоду("840");
	Рубли				=Справочники.Валюты.НайтиПоКоду("810");
	
	ВалютаУпр			=?(Дата>='20090101',ПараметрыСеанса.ВалютаУпр_2009,ПараметрыСеанса.ВалютаУпр);
	Если Сумма <> 0 Тогда
		
		ВалютаРасчетов_Дебитор	=ПолучитьВалютуРасчетов(Договор_Дебитор);	
		ВалютаРасчетов_Кредитор	=ПолучитьВалютуРасчетов(Договор_Кредитор);	
		
		СуммаВАЛ_Дебитор	= глПересчет(Сумма,Валюта,Курс,ВалютаРасчетов_Дебитор,Дата);
		СуммаВАЛ_Кредитор	= глПересчет(Сумма,Валюта,Курс,ВалютаРасчетов_Кредитор,Дата);
		
		СуммаУпр			= глПересчет(Сумма,Валюта,Курс,ВалютаУпр,Дата);	
		
		Движение 					= Движения.Взаиморасчеты.Добавить();
		Движение.ВидДвижения		= ВидДвиженияНакопления.Расход;
		
		Движение.Период				= Дата;
		Движение.Контрагент			= Контрагент_Дебитор;
		Движение.Договор 			= Договор_Дебитор;			
		
		Движение.СуммаВал			= Модуль(СуммаВАЛ_Дебитор);
		Движение.СуммаУпр			= Модуль(СуммаУпр);
		
		Движение.СуммаДокумента		= Сумма;
		Движение.ВалютаДокумента	= Валюта;	
		
		Движение.КодОперации		= Перечисления.КодыОперацийОстатки.Взаимозачет;
		
		Движение 					= Движения.Взаиморасчеты.Добавить();
		Движение.ВидДвижения		= ВидДвиженияНакопления.Приход;
		
		Движение.Период				= Дата;
		Движение.Контрагент			= Контрагент_Кредитор;
		Движение.Договор 			= Договор_Кредитор;			
		
		Движение.СуммаВал			= Модуль(СуммаВАЛ_Кредитор);
		Движение.СуммаУпр			= Модуль(СуммаУпр);
		
		Движение.СуммаДокумента		= Сумма;
		Движение.ВалютаДокумента	= Валюта;	
		
		Движение.КодОперации		= Перечисления.КодыОперацийОстатки.Взаимозачет;
	КонецЕсли;
	//сформируем проводки по ТЧ
	Если Взаимозачеты.Количество() <> 0 Тогда
		Для Каждого СтрокаТЧ Из Взаимозачеты Цикл
			ВалютаРасчетов_Дебитор	=ПолучитьВалютуРасчетов(СтрокаТЧ.Договор_Дебитор);	
			ВалютаРасчетов_Кредитор	=ПолучитьВалютуРасчетов(СтрокаТЧ.Договор_Кредитор);	
			
			СуммаВАЛ_Дебитор	= глПересчет(СтрокаТЧ.Сумма,Валюта,Курс,ВалютаРасчетов_Дебитор,Дата);
			СуммаВАЛ_Кредитор	= глПересчет(СтрокаТЧ.Сумма,Валюта,Курс,ВалютаРасчетов_Кредитор,Дата);
			
			СуммаУпр			= глПересчет(СтрокаТЧ.Сумма,Валюта,Курс,ВалютаУпр,Дата);	
			
			Движение 					= Движения.Взаиморасчеты.Добавить();
			Движение.ВидДвижения		= ВидДвиженияНакопления.Расход;
			
			Движение.Период				= Дата;
			Движение.Контрагент			= СтрокаТЧ.Контрагент_Дебитор;
			Движение.Договор 			= СтрокаТЧ.Договор_Дебитор;			
			
			Движение.СуммаВал			= Модуль(СуммаВАЛ_Дебитор);
			Движение.СуммаУпр			= Модуль(СуммаУпр);
			
			Движение.СуммаДокумента		= СтрокаТЧ.Сумма;
			Движение.ВалютаДокумента	= Валюта;	
			
			Движение.КодОперации		= Перечисления.КодыОперацийОстатки.Взаимозачет;
			
			Движение 					= Движения.Взаиморасчеты.Добавить();
			Движение.ВидДвижения		= ВидДвиженияНакопления.Приход;
			
			Движение.Период				= Дата;
			Движение.Контрагент			= СтрокаТЧ.Контрагент_Кредитор;
			Движение.Договор 			= СтрокаТЧ.Договор_Кредитор;			
			
			Движение.СуммаВал			= Модуль(СуммаВАЛ_Кредитор);
			Движение.СуммаУпр			= Модуль(СуммаУпр);
			
			Движение.СуммаДокумента		= СтрокаТЧ.Сумма;
			Движение.ВалютаДокумента	= Валюта;	
			
			Движение.КодОперации		= Перечисления.КодыОперацийОстатки.Взаимозачет;
			
		КонецЦикла;	
	КонецЕсли;
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	Если ОбменДанными.Загрузка Тогда
		Движения.Взаиморасчеты.Записать();	
	КонецЕсли; 
КонецПроцедуры

//СОБЫТИЯ ОБЪЕКТА
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	ЕстьИзменения		=Модифицированность();
	НужноВыгружать		=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	
	Если НЕ ОбменДанными.Загрузка Тогда		
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		
		Если Отказ Тогда Возврат КонецЕсли; 		
	КонецЕсли;	
	
	Если Отказ Тогда Возврат КонецЕсли;	
	
	Если НужноВыгружать Тогда
		//Катаев+ 08/10/14
		Если Не ЭтотОбъект.Ссылка.Пустая() Тогда
			НужноВыгружать = Ложь;
		КонецЕсли;
		//Катаев- 08/10/14
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
		//Катаев+ 08/10/14
		Если Не ЭтотОбъект.Ссылка.Пустая() Тогда
			НужноВыгружать = Ложь;
		КонецЕсли;
		//Катаев- 08/10/14
	КонецЕсли;
КонецПроцедуры

//крохин начало 24.05.2012
Процедура ПриКопировании(ОбъектКопирования)
	Если ДокОснование = Неопределено Тогда
	Возврат;	
КонецЕсли;
ДатаОплаты = ДокОснование.ДатаОплаты;
КонецПроцедуры

//крохин конец 24.05.2012

//Чирков начало 07.03.2013
Процедура ОбработкаЗаполнения(Основание)
	Если ТипЗнч(Основание)=Тип("Структура") Тогда Возврат КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Основание) Тогда Возврат КонецЕсли; 
	
	ТипОснования=ТипЗнч(Основание);
	Если ТипОснования=Тип("ДокументСсылка.ЗаявкаНаОплату") Тогда		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Основание);
		Запрос.Текст =" 
		|ВЫБРАТЬ	
		|	Сотрудник,
		|	МАКСИМУМ(Договоры.Ссылка) КАК Договор
		|ПОМЕСТИТЬ ДоговорыПодотчет
		|ИЗ
		|	Документ.ЗаявкаНаОплату.Подотчет КАК ЗаявкаНаОплатуПодотчет
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	Справочник.Договоры КАК Договоры
		|ПО
		|	ЗаявкаНаОплатуПодотчет.Сотрудник	=Договоры.Владелец 	
		|	И Договоры.ВидДоговора_Новый		=&ВидДоговораПодОтчет
		|	И НЕ Договоры.ПометкаУдаления
		|ГДЕ
		|	ЗаявкаНаОплатуПодотчет.Ссылка=&ЗНО
		|СГРУППИРОВАТЬ ПО 
		|	Сотрудник
		|;
		|ВЫБРАТЬ
		|	ЗаявкаНаОплатуПодотчет.Сотрудник 	КАК Контрагент_Кредитор,
		|	ДоговорыПодотчет.Договор			КАК Договор_Кредитор,
		|	ЗаявкаНаОплатуПодотчет.Сумма		КАК Сумма
		|ИЗ	
		|	Документ.ЗаявкаНаОплату.Подотчет КАК ЗаявкаНаОплатуПодотчет	
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ДоговорыПодотчет
		|ПО
		|	ДоговорыПодотчет.Сотрудник=ЗаявкаНаОплатуПодотчет.Сотрудник			
		|ГДЕ
		|	ЗаявкаНаОплатуПодотчет.Ссылка		=&ЗНО";
		
		ВидДоговораПодОтчет	= Справочники.ВидыДоговоров.НайтиПоНаименованию("Под отчёт", Истина);	
		
		Запрос.УстановитьПараметр("ЗНО",Основание);
		Запрос.УстановитьПараметр("ВидДоговораПодОтчет",ВидДоговораПодОтчет);		
		
		Выборка = Запрос.Выполнить().Выбрать();
		// заполняем таб.часть Взаимозачеты
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = Взаимозачеты.Добавить();			
			
			НоваяСтрока.Контрагент_Дебитор	= Основание.Контрагент;
			НоваяСтрока.Договор_Дебитор		= Основание.Договор;
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);			
		КонецЦикла;		
	КонецЕсли; 
КонецПроцедуры
//Чирков конец 07.03.2013

//Катаев+ 08/10/14
Процедура ПриЗаписи(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если НужноВыгружать Тогда
		ЗанестиФилиалыВРегистрПолучателей(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры
//Катаев- 08/10/14
